vlm/base/DataProcessors/бит_ПечатьСерийЭтикеток.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ПечатьСерийЭтикеток</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьСразу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

vlm/base/InformationRegisters/бит_СерииЭтикетокВСменномЗадании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_СерииЭтикетокВСменномЗадании</Name>
			<Comment>ЛТ5.30</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Напечатано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПроизводственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПроизводственнаяОперация2_2</v8:Type>
						<v8:Type>cfg:DocumentRef.ПроизводствоБезЗаказа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

vlm/base/Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СерииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерСерии</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКиЗГИСМ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерКиЗГИСМ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDTID</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDTID</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDUser</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDEPC</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDEPC</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EPCGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDМеткаНеЧитаемая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Справка2ЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписьСкладскогоЖурналаВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПартииВЕТИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяРозничнаяЦенаМОТП</Name>
					<Comment>Максимальная розничная цена (МОТП)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияНоменклатурыДляЦенообразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_НомерЗавеса</Name>
					<Comment>// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_НомерЗаказа</Name>
					<Comment>// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Брутто</Name>
					<Comment>// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ТипТары</Name>
					<Comment>// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Штрихкод</Name>
					<Comment>// Первыйбит ЛТ8.10.9 ЛапшовГ "GVLapshov@1cbit.ru" 28.04.2025</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_НормативнаяМасса</Name>
					<Comment>ЛТ5.30</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Эмалировщик</Name>
					<Comment>ЛТ5.30</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Завешено</Name>
					<Comment>ЛТ5.26</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_МассаНетто</Name>
					<Comment>ЛТ5.26</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Весовщик</Name>
					<Comment>ЛТ5.26</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_СменаВесовщика</Name>
					<Comment>ЛТ5.26</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СменыВесовщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ДатаВремяЗавеса</Name>
					<Comment>ЛТ5.26</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Контроллёр</Name>
					<Comment>ЛТ5.26</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ВидРабочегоЦентра</Name>
					<Comment>ЛТ_БН</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Смена</Name>
					<Comment>ЛТ_БН</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Перемаркировка</Name>
					<Comment>ЛТ_БН</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

vlm/base/DataProcessors/бит_ПечатьСерийЭтикеток/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура СерияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если не ЗначениеЗаполнено(Объект.Номенклатура) Тогда 
		СтандартнаяОбработка = Истина;
		Возврат;
	КонецЕсли;
	
	СписокДоступныхСерий = ПолучитьСписокДоступныхСерийНаСервере(Объект.Номенклатура);
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораСерии", ЭтотОбъект);
	
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
	ЭлементОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ПравоеЗначение = СписокДоступныхСерий;
	
	ВладелецСерий = бит_ПечатьСерийЭтикетокВызовСервера.ВладелецСерийВидаНоменклатуры(Объект.Номенклатура);
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ВидНоменклатуры", ВладелецСерий);
			
	ПФ = Новый Структура;
	ПФ.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);
	ПФ.Вставить("Отбор", ПараметрыОтбора); 
    ПФ.Вставить("ВидНоменклатуры", ВладелецСерий);
	ПФ.Вставить("РежимВыбора", Истина);
	ПФ.Вставить("МножественныйВыбор", Ложь);
	ПФ.Вставить("ЗакрыватьПриВыборе", Истина);
	
	ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.ФормаВыбора", ПФ, ЭтотОбъект, УникальныйИдентификатор, , , Оповещение);

КонецПроцедуры             

&НаКлиенте
Процедура ПослеВыбораСерии(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		
		Объект.Серия = ВыбранноеЗначение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокДоступныхСерийНаСервере(Номенклатура)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	бит_СерииЭтикетокВСменномЗадании.СерияНоменклатуры КАК СерияНоменклатуры
	|ИЗ
	|	РегистрСведений.бит_СерииЭтикетокВСменномЗадании КАК бит_СерииЭтикетокВСменномЗадании
	|ГДЕ
	|	бит_СерииЭтикетокВСменномЗадании.Номенклатура = &Номенклатура
	|	И бит_СерииЭтикетокВСменномЗадании.ПроизводственнаяОперация ССЫЛКА Документ.ПроизводственнаяОперация2_2"); 
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СерияНоменклатуры"));
	
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	
	КомандаПечать();
	
КонецПроцедуры      

&НаКлиенте
Процедура КомандаПечать() 
	
	АдресТаблицыТоваров = ПолучитьАдресДанныеДляПечатиНаСервере();
	Если АдресТаблицыТоваров <> Неопределено Тогда                   
		бит_ПечатьСерийЭтикетокКлиент.ОткрытьФормуПечати(АдресТаблицыТоваров, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресДанныеДляПечатиНаСервере()
	Если не ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура", Объект.Номенклатура);
	Структура.Вставить("Исполнитель", Объект.Серия.бит_Эмалировщик); // Для ДопСвойство ШтампЭмалировщика
	Структура.Вставить("ВидРабочегоЦентра", Объект.Серия.бит_ВидРабочегоЦентра);
	МассивСерий = Новый Массив;
	МассивСерий.Добавить(Объект.Серия);
	Структура.Вставить("МассивСерий", МассивСерий);
	Структура.Вставить("Смена", Объект.Серия.бит_Смена);
	
	Возврат РегистрыСведений.бит_СерииЭтикетокВСменномЗадании.СформироватьДанныеДляПечатиЭтикетокИзСменногоЗадания(Структура);

КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Номенклатура) Тогда
		Объект.Номенклатура = Параметры.Номенклатура;
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.Серия) Тогда
		Объект.Серия = Параметры.Серия;
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.ПечатьСразу) ТОгда
		Объект.ПечатьСразу = Параметры.ПечатьСразу;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ПечатьСразу и ЗначениеЗаполнено(Объект.Номенклатура) И ЗначениеЗаполнено(Объект.Серия) Тогда
		КомандаПечать();
	КонецЕсли;
	
КонецПроцедуры
